__all__ = [
    "finish_message",
    "get_age_message",
    "get_location_message",
    "get_photo_message",
    "get_sex_message",
    "start_message",
    "start_to_run_message",
]

start_message = (
    "Приветствую! Я Клевер — твой верный помощник в сфере интернет-знакомств! "
    "Здесь я для того, чтобы помочь тебе найти свою вторую половинку или же "
    "настоящего друга. Давай начнем этот увлекательный путь вместе! 😊"
)

start_to_run_message = (
    "Давно не виделись! Заметил, что ты уже некоторое время не пользовался "
    "моими возможностями 🥺"
)

get_age_message = (
    "Я хотел бы узнать немного больше о тебе! Не мог бы ты поделиться своим "
    "возрастом со мной? Это поможет предлагать профили людей, которые "
    "находятся в твоем возрастном диапазоне и имеют общие интересы."
)

get_sex_message = (
    "Чтобы я мог подобрать для тебя наиболее подходящие анкеты, мне нужно "
    "знать еще и твой пол:"
)

get_location_message = (
    "Чтобы я мог помочь тебе найти интересных людей поблизости, мне нужно "
    "знать, в каком городе ты находишься. Будь уверен, все твои личные данные "
    "будут строго конфиденциальны и не будут переданы третьим лицам 🤐"
)

get_photo_message = (
    "Чтобы твой профиль был еще интереснее и привлекательнее для других "
    "пользователей, я предлагаю добавить фото. Фотография поможет другим "
    "узнать тебя лучше и создать более личное впечатление 📸✨"
)

finish_message = "Не стесняйся и начинай искать новых друзей!"
